controllers/CartController.php

SELECT * FROM `product` WHERE `id`='4'
---
    public function actionAdd(){
        $id = Yii::$app->request->get('id');
        $qty = (int)Yii::$app->request->get('qty');
        $qty = !$qty ? 1 : $qty;
        $product = Product::findOne($id);

INSERT INTO `order` (`name`, `email`, `phone`, `address`, `qty`, `sum`, `created_at`, `updated_at`) VALUES ('dfsdfs', 'sss@gmail.com', '342423423', 'dsvdsvdcv', 1, 20, NOW(), NOW())
---
    public function actionView()
    {

        $session = Yii::$app->session;
        $session->open();
        $this->setMeta('Корзина');
        $order = new Order();
        if ($order->load(Yii::$app->request->post())) {
            $order->qty = $session['cart.qty'];
            $order->sum = $session['cart.sum'];
            if ($order->save()) {

INSERT INTO `order_items` (`order_id`, `product_id`, `name`, `price`, `qty_item`, `sum_item`) VALUES (19, 3, 'Блуза Mango 53005681-05 M Бежевая', 20, 1, 20)
---
    protected function saveOrderItems($items, $order_id){
        foreach($items as $id => $item){
            $order_items = new OrderItems();
            $order_items->order_id = $order_id;
            $order_items->product_id = $id;
            $order_items->name = $item['name'];
            $order_items->price = $item['price'];
            $order_items->qty_item = $item['qty'];
            $order_items->sum_item = $item['qty'] * $item['price'];
            $order_items->save();