controllers/CategoryController.php

SELECT * FROM `product` WHERE `hit`='1' LIMIT 6
---
    public function  actionIndex()
    {
        $hits = Product::find()->where(['hit' => '1'])->limit(6)->all();