controllers/ProductController.php

SELECT * FROM `product` WHERE `id`='4'
SELECT * FROM `product` WHERE `hit`='1' LIMIT 6
---
    public function actionView($id)
    {
        $id = Yii::$app->request->get('id');
        $product = Product::findOne($id);

        if ($product === null) { // item does not exist
            throw new HttpException(404, 'Такого товара нет.');
        }

        $hits = Product::find()->where(['hit' => '1'])->limit(6)->all();