widgets/MenuWidget.php

SELECT * FROM `category`
---
    public function run()
    {
        if ($this->tpl == 'menu.php'){
            $menu = Yii::$app->cache->get('menu');
            if($menu) return $menu;
        }


        $this->data = Category::find()->indexBy('id')->asArray()->all();